In [1]:
import csv
import pandas as pd
import datetime as dt

In [2]:
path = "Resources/Nashville_calendar.csv"

In [3]:
df1 = pd.read_csv(path)

In [4]:
df1.head()

   listing_id        date available   price
0        6422  2019-07-23         f     NaN
1      637425  2019-11-14         t  $85.00
2      637425  2019-11-13         t  $85.00
3      637425  2019-11-12         t  $85.00
4      637425  2019-11-11         t  $85.00

In [5]:
df1 = df1.sort_values(by="date",ascending= True)

In [6]:
df1.head()

         listing_id        date available    price
2161164    27423179  2018-11-15         t   $56.00
1194280    20972023  2018-11-15         f      NaN
361043     12016963  2018-11-15         t  $199.00
1194106    21177218  2018-11-15         f      NaN
361179     10653657  2018-11-15         f      NaN

In [7]:
df1.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [8]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [9]:
df2.head()

         listing_id       date available    price
2161164    27423179 2018-11-15         t   $56.00
1194280    20972023 2018-11-15         f      NaN
361043     12016963 2018-11-15         t  $199.00
1194106    21177218 2018-11-15         f      NaN
361179     10653657 2018-11-15         f      NaN

In [10]:
today_dt = dt.date.today()
today = dt.datetime.strftime(today_dt, '%Y-%m-%d')

#extract year, month, and day as integers
todayYear = int(dt.datetime.strftime(today_dt, '%Y'))
todayMonth = int(dt.datetime.strftime(today_dt, '%m'))
todayDay = int(dt.datetime.strftime(today_dt, '%d'))


week_later_dt = dt.date(todayYear, todayMonth, todayDay) + dt.timedelta(days=8)
week_later = dt.datetime.strftime(week_later_dt, '%Y-%m-%d')
week_later

'2018-12-30'

In [11]:
df2 = df2.loc[(df2['date']>=today) & (df2['date']<week_later) & (df2['available']=='t'),:]
df2.head()

         listing_id       date available    price
1680137    24749438 2018-12-22         t   $79.00
1625774    23823805 2018-12-22         t  $324.00
647765     15411385 2018-12-22         t  $130.00
1188953    21152967 2018-12-22         t  $809.00
850907     18548337 2018-12-22         t  $185.00

In [12]:
df2['price'].value_counts().head()
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
dtype: object

In [13]:
df2["new_price"] = df2["price"].str.strip('$')

C:\Users\Martin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [14]:
df2["new_price"] = pd.to_numeric(df2["new_price"],errors='coerce')

C:\Users\Martin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [15]:
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
new_price            float64
dtype: object

In [16]:

bins = [0, 50, 100, 150, 200, 250]

# Create the names for the four bins
group_names = ["Under $50", "$50-100", "$100-150", "$150-200", "$200-250"]

df2["price"] = pd.cut(df2["new_price"], bins, labels=group_names)

C:\Users\Martin\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys

In [17]:
# today_dt
under_50 = []
fifty_100 = []
hundred_150 = []
onefifty_200 = []
twohundred_250 = []

numdays = 8
date_list = [today_dt + dt.timedelta(days=x) for x in range(0, numdays)]

date_list = [dt.datetime.strftime(i, '%Y-%m-%d') for i in date_list]
date_list

for i in date_list:
    prices = df2.loc[df2["date"] == i, "price"].value_counts()
    under_50.append(prices[0])
    fifty_100.append(prices[1])
    hundred_150.append(prices[2])
    onefifty_200.append(prices[3])
    twohundred_250.append(prices[4])

In [18]:
df3 = pd.DataFrame({"Date": date_list, 
                     "Under $50": under_50, 
                     "$50-100": fifty_100, 
                     "$100-150": hundred_150,
                     "$150-200": onefifty_200,
                     "$200-250": twohundred_250
                    })
df3
Nashville_airbnb = df3
# df3.set_index("Date")

In [19]:
Nashville_airbnb

         Date  Under $50  $50-100  $100-150  $150-200  $200-250
0  2018-12-22        116      564       562       557       571
1  2018-12-23        152      912       801       469       469
2  2018-12-24        155      992       719       696       351
3  2018-12-25        147      973       702       692       353
4  2018-12-26        147      892       672       722       347
5  2018-12-27        137      698       564       390       256
6  2018-12-28        109      339       279       309       236
7  2018-12-29         99      275       201       223       188